xzcvczx/mla-legacy/mTouchCapDemos/PIC24FDemos/mTouchCap_Low Power/mTouchCap_PIC24F_LowPower.c
/********************************************************************
 * Function		:    int main(void)
 *
 * PreCondition	:    None
 *
 * Input		:    None
 *
 * Output		:    None
 *
 * Side Effects	:    None
 *
 * Overview		: The Application main function
 *
 *
 * Note			:
 *******************************************************************/
int main(void)
{
	


  	/***************************************************************************
	--------------- mTouchCapApp_CreateDirectKeys" -----------------------		

	***************************************************************************/
	#ifdef USE_DIRECT_KEYS	

	mTouchCapApp_CreateDirectKeys();
	#endif


    /* This is mandatory function call to initilize physical layer. Call this function before any application layer code. */
    mTouchCap_Init();                            	// Launch Device Initializations  

    mTouchCapApp_powerOnLEDSeq();                   // Run "Chaser" LED sequence on slider LEDs
    
    while(1)
    {

        if (dataReadyCTMU == 1)                      // This flag is set by Timer 4 ISR when all channels have been read										
        {
            dataReadyCTMU = 0;                      //clear flag


            Set_ScanTimer_IF_Bit_State(DISABLE);    //Clear timer 4 SHORT flag
            Set_ScanTimer_IE_Bit_State(DISABLE);    //Disable interrupt
            Set_ScanTimer_ON_Bit_State(DISABLE);    //Stop timer 4


            /****************************************************************************************
			--------------- Demo of API "mTouchCapAPI_GetStatusDirectButton" -----------------------		
			Get the status of a Direct key press using the API "mTouchCapAPI_GetStatusDirectButton" 
			whose channel number is mentioned. The below function intern calls the mentioned API.
	        ****************************************************************************************/
            #ifdef USE_DIRECT_KEYS                  // Number pad is 4x5 matrix

            /* Demo Matrix Keys */
            mTouchCapApp_DemoDirectKeys();
            #endif
			
			#ifdef LOW_POWER_DEMO_ENABLE
				//Function to implement the low power demo logic
				mTouchCapApp_LowPower_Process();
			#endif

            Set_ScanTimer_IF_Bit_State(DISABLE);    //Clear flag
            Set_ScanTimer_IE_Bit_State(ENABLE);     //Enable interrupt
            Set_ScanTimer_ON_Bit_State(ENABLE);     //Run timer
        }   // end if(dataReadyCTMU)
     }       //end while (1)
}           // end main()

/*********   	End of Function 	*********************/


/********************************************************************
 * Function			:    void mTouchCapApp_PortSetup(void)
 *
 * PreCondition		:    None
 *
 * Input			:    None
 *
 * Output			:    None
 *
 * Side Effects		:    None
 *
 * Overview			: 	Initialize the Ports. Set the appropriate value of initialization in HardwareProfile.h file.
 *
 * Note				: 	User can define the right values of Ports pins here.
 *******************************************************************/
void mTouchCapApp_PortSetup(void)
{
    CLKDIV = INIT_CLKDIV_VALUE;

    #ifdef PIC24F_LOW_PIN_DEVICE    // Initialise ports for low pin devices

	TRISB = INIT_TRISB_VALUE;
	PORTB = INIT_PORTB_VALUE;

	#else     
    TRISB = INIT_TRISB_VALUE;
    TRISC = INIT_TRISC_VALUE;
    TRISD = INIT_TRISD_VALUE;
    TRISE = INIT_TRISE_VALUE;
    TRISF = INIT_TRISF_VALUE;
    TRISG = INIT_TRISG_VALUE;

    PORTB = INIT_PORTB_VALUE;
    PORTC = INIT_PORTC_VALUE;
    PORTD = INIT_PORTD_VALUE;
    PORTE = INIT_PORTE_VALUE;
    PORTG = INIT_PORTG_VALUE;

     
    PORTE = 0x0000;
    PORTD = 0x0000;
	#endif
}




/******************************************************************************
 * Function:       mTouchCapApp_LowPower_Process(void)
 *
 * PreCondition:    The updateCTMU() function should be called before invoking
					this function to get the status of the keys
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:       	This function is used for the Low power demo. This will
					help in reducing the power consumption by keeping the
					device in Sleep mode for 2sec using the WDT if none of the 
 					keys are pressed within the 10sec timeout. 
					If the key press is sensed before the 10sec timeout is elapsed
					reset the 10sec timeout counter and restart the timeout.
					
	
 * Note:            None
 *****************************************************************************/
#ifdef LOW_POWER_DEMO_ENABLE

void mTouchCapApp_LowPower_Process(void)
{
		CHAR Osc_value;
 					
		//if there is any key touch sensed, reset the key pressed counter and the timeout logic will not be enabled
		//if any of the Cap touch keys are not touched, then start the timeout for about 10sec so that if none of the 
		//keys are pressed within the timeout period, go to the sleep mode for about 2sec using a WDT timer.
		//after the device comes out of the sleep scan all the keys to detect if there is any touch and repeat 
		//the process
		// If none of the Captouch keys are pressed after the devices comes out of the sleep, switch the clock from
		//Primary to the lower clock value(FRC without PLL) .The subsequent timeout is selected as 4 sec when the 
		// system clock is switched to FRC
		//If there is any key press sensed after the clock is switched from Primary to FRC, then switch back the 
		//system clock to the Primary clock and continue the normal process

		//The 10sec timeout is calculated based on the current clock selection
		//Timeout_counter is incremented for evert Timer4 interrupt 
		
			if(Timeout_Counter > Timeout_select)	// check the status of the keys after 10sec timeout is acheived
			{
		
				Timeout_Counter =0;		//reset the 10sec timeout counter since the key was pressed within 
												// the 10sec timeouts
							
				if(CapTouchkey_pressed_status)	//if any of the Cap touch keys are pressed
				{
					CapTouchkey_pressed_status =0;	 //reset the counter which indicates the keys pressed status
				}
				else
				{
					//start a time out for 10sec if there is no touch sensed in any of the keys
					//if there is any touch sensed within the timeout period reset the timer
					//if none of the keys are pressed within the 10sec timeout, put the device in
					//sleep mode and it comes out of the Sleep using a WDT timeout.


					//Turn off all the modules and make the port pin as output when the device goes to sleep
					#ifndef PIC24F_LOW_PIN_DEVICE
					
					AD1PCFG = 0xFFFF;		//make the analog channels as digital only for sleep conditions

