xzcvczx/mla-legacy/mTouchCapDemos/PIC24FDemos/mTouchCap_Low Power/mTouchCap_PIC24F_LowPower.c
					PMD1 = 0xBFFE;			//ADC and Timer4 is not turned OFF
					PMD2 = 0xFFFF;
					PMD3 = 0xFFFF;
					PMD4 = 0xFFFB;			//CTMU is not turned OFF
					PMD5 = 0xFFFF;
					PMD6 = 0xFFFF;



					TRISB = 0;	
					TRISC = 0;
					TRISD = 0;
					TRISE = 0;
					TRISF = 0;
					TRISG = 0;


					LATB = 0;		
					LATC = 0;
					LATD = 0;
					LATE = 0;
					LATF = 0;
					LATG = 0;

					

					//Set the WDT to wake up the device from CPU
					//The WDT time out is set to 128msec (1:32) when the WDT Prescalar ratio is 1:128(7 bit)
					RCONbits.SWDTEN = 1;		//enable the WDT 
					Nop();
					// the device is placed in sleep for the duration which is selected by the WDT postscalar bits
					Sleep();
					Nop();

					RCONbits.SWDTEN = 0;		//Disable the WDT so that the system is not reset for every WDT timeout
				

					//turn on all the modules after device comes out of sleep

					PMD1 = 0x0000;
					PMD2 = 0x0000;
					PMD3 = 0x0000;
					PMD4 = 0x0000;
					PMD5 = 0x0000;
					PMD6 = 0x0000;
					//The FRC clock switch mode will be implemented only when the macro is enabled
					//If the macro is disabled, then the clock is not switched to FRC from Primary
					#ifdef CLOCK_SWITCH_DURING_SLEEP_ENABLE
						//if the device has entered the sleep mode, it indicates that none of the 
						// captouch keys were pressed and it would be better to shift the system clock to the
						//lowest possible value so as to reduce the power consumption.
						//The original system clock configurations will be restored if any of the captouch keys are
						//pressed after the device wakes up from the sleep.
						CapTouch_Sleep_Wakeup_Flag = HIGH;	//flag to indicate that device is out of sleep mode.
						//The System clock should be switched from Primary to FRC
						//The Clock_Switch_Enable_Flag is used from avoiding re-initialization of the oscilator.
						//The Initialization should be done only once
						if(!Clock_Switch_Enable_Flag)
						{
							//Disable the interrupts before the clock switch
							Set_ScanTimer_IF_Bit_State(DISABLE);    //Clear timer 4 SHORT flag
			            	Set_ScanTimer_IE_Bit_State(DISABLE);    //Disable interrupt
			            	Set_ScanTimer_ON_Bit_State(DISABLE);    //Stop timer 4
							
							Osc_value =FRCDIV_CLOCK; 
							//select FRC for the scanning after the device icomes out of the sleep
							UnlockOscillator(Osc_value);
							//The FRC clock is 8Mhz. 
							//RCDIV<2:0> = 011 -- divide by 8
							CLKDIV = FRC_POSTSCALAR_DIVIDE_1; //FRC_POSTSCALAR_DIVIDE_8; //FRC_POSTSCALAR_DIVIDE_2;
							//Charge the selected Capsense keys when the FRC clock is used
							Clock_Switch_Enable_Flag = HIGH;	//testing

							//This flag is required to load the CurRawData to the AverageData when the FRC clock is selected
							Default_RawData_with_FRC_Flag = HIGH;
						}
						
						//The flag is used just to make sure that the initialization of the timer happens only once when the 
						//system clock is selected as FRC clock
						if(!Timer4_Period_Clock_Switch_Flag)
						{
							mTouchCapPhy_TickInit();
											

						}
						
						//change the Timeout count based on the swtiched clock value(FRC)
						Timeout_select= TIMEOUT_AFTER_FRC_CLOCK_SWITCH ;



					#endif 	//end of #ifdef CLOCK_SWITCH_DURING_SLEEP_ENABLE
					
					//testing
					PORTD = 0x0000; Nop(); //display LED D15 to indicate that device has come out of sleep
					PORTE = 0x0040;
					#endif
					//turn on all the modules after device comes out of sleep
//
//					PMD1 = 0x0000;
//					PMD2 = 0x0000;
//					PMD3 = 0x0000;
//					PMD4 = 0x0000;
//					PMD5 = 0x0000;
//					PMD6 = 0x0000;
				

				
				}//end of if(CapTouchkey_pressed_status)

			}
			else
			{
				//if the 10sec timeout is not elapsed and if one of the keys are pressed, then reset the 
				//10sec timeout counter since there was a touch in one or more keys and hence the timeout should 
				//be reset
				if(CapTouchkey_pressed_status)		//if any of the Cap touch keys are pressed
				{
					Timeout_Counter = 0;			//reset the 10sec timeout counter since the key was pressed within 
													// the 10sec timeout
					CapTouchkey_pressed_status =LOW;//reset the pressed status 

				
					// If any of the Captouch keys were pressed after the device was in sleep mode
					//and it was released by the WDT timer interrupt, then restore the actual system clock settings
				
				#ifdef CLOCK_SWITCH_DURING_SLEEP_ENABLE
					if(CapTouch_Sleep_Wakeup_Flag)
					{
						CapTouch_Sleep_Wakeup_Flag = LOW;	
						Timer4_Period_Clock_Switch_Flag =LOW;		//disable the flag for loading the values for Timer4 period 
						Clock_Switch_Enable_Flag =LOW;				//Disable the flag for enabling FRC clock
						//Disable the timer so that the interrupt is not generated during clock switch
						Set_ScanTimer_IF_Bit_State(DISABLE);    	//Clear timer 4 interrupt flag
	            		Set_ScanTimer_IE_Bit_State(DISABLE);    	//Disable interrupt
	            		Set_ScanTimer_ON_Bit_State(DISABLE);    	//Stop timer 4
						
						//switch back to the actual system clock settings if any of the 
						//captouch key is pressed
						Osc_value = PRIMARY_PLL_CLOCK;
						UnlockOscillator(Osc_value);
						//Restore the Primary clock postscalar settings which was changed when
						// the system clock was switched to  FRC
						CLKDIV = 0x0000; //FRC_POSTSCALAR_DIVIDE_1;
						
						//Restore the Timer1 values based on Primary clock 
						mTouchCapPhy_TickInit();
						//restore the 10sec timeout value for Primary clock
						Timeout_select= TIMEOUT_10SEC_PRIPLL_CLOCK;

					}
				#endif	//end of #ifdef CLOCK_SWITCH_DURING_SLEEP_ENABLE
					
				}	
		
			
			}//end of if(Timeout_Counter >= 10000)



}	//end of void mTouchCapApp_LowPower_Process(void)

#endif //end of #ifdef LOW_POWER_DEMO_ENABLE

/******************************************************************************
 * Function:       void  UnlockOscillator(BYTE Switch_Osc_value)
 *
 * PreCondition:    This function is used for the low power demo 

 *
 * Input:           the value of the oscillator that has to be set 
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:       	This function is used to switch the clock source 
					during runtime
					
	
 * Note:            None
 *****************************************************************************/
#ifdef LOW_POWER_DEMO_ENABLE

	void  UnlockOscillator(BYTE Switch_Osc_value)
	{
	            OsciValue = Switch_Osc_value ; //NewOscillatorValue;
	
				temp=OsciValue;
	
	//            asm ("MOV _OsciValue,W0");
	            asm ("MOV _temp,W0");	
				//asm ("MOV #5,W0");
				asm ("MOV #OSCCON+1, w1");
	            asm ("MOV #0x78, w2");
	            asm ("MOV #0x9A, w3");
	            asm ("MOV.b w2, [w1]");
	            asm ("MOV.b w3, [w1]");
	            asm ("MOV.b WREG, OSCCON+1");
	//;OSCCONL (low byte) unlock sequence
	
	            asm ("MOV #OSCCON, w1");
	            asm ("MOV #0x46, w2");
	            asm ("MOV #0x57, w3");
	            asm ("MOV.b w2, [w1]");
	            asm ("MOV.b w3, [w1]");
	            asm ("BSET OSCCON,#0");
	
	            while(OSCCONbits.OSWEN);
	}

#endif //end of #ifdef LOW_POWER_DEMO_ENABLE



/*********   	End of Function 	*********************/
